Apply temporal EDA, user-defined functions, and stored procedures to solve a business case problem. Analyze the New York City taxi ride dataset to identify average fare per distance, ride count, and total ride time for each borough on each day of the week. And which pickup locations within the borough should be scheduled for each driver shift? Dataset from here: [TLC Trip Record Data](https://www.nyc.gov/site/tlc/about/tlc-trip-record-data.page)

In [2]:
import pandas as pd
import sqlalchemy

In [3]:
from sqlalchemy import create_engine

In [4]:
%load_ext sql

In [8]:
%%sql
SELECT *
FROM yellowtrip
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/postgres
5 rows affected.

[(2, datetime.datetime(2020, 8, 1, 0, 7, 4), datetime.datetime(2020, 8, 1, 0, 20, 28), 1, Decimal('2.3'), 1, 'N', 238, '143', 2, Decimal('11.0'), Decimal('0.0'), Decimal('0.5'), Decimal('0.0'), Decimal('0.0'), Decimal('0.3'), Decimal('11.8')),
 (2, datetime.datetime(2020, 3, 5, 18, 6, 6), datetime.datetime(2020, 3, 5, 18, 11, 37), 1, Decimal('0.9'), 1, 'N', 234, '79', 1, Decimal('5.5'), Decimal('0.0'), Decimal('0.5'), Decimal('1.26'), Decimal('0.0'), Decimal('0.3'), Decimal('7.56')),
 (2, datetime.datetime(2020, 3, 5, 18, 1, 50), datetime.datetime(2020, 3, 5, 18, 5, 26), 1, Decimal('0.49'), 1, 'N', 90, '234', 2, Decimal('4.5'), Decimal('0.0'), Decimal('0.5'), Decimal('0.0'), Decimal('0.0'), Decimal('0.3'), Decimal('5.3')),
 (2, datetime.datetime(2019, 11, 20, 22, 10, 22), datetime.datetime(2019, 11, 20, 22, 28, 11), 5, Decimal('4.32'), 1, 'N', 264, '264', 1, Decimal('16.0'), Decimal('0.5'), Decimal('0.5'), Decimal('1.7'), Decimal('0.0'), Decimal('0.3'), Decimal('19.0')),
 (2, datetime.datetime(2019, 6, 28, 18, 48, 49), datetime.datetime(2019, 6, 28, 19, 2, 17), 1, Decimal('1.67'), 1, 'N', 114, '224', 2, Decimal('9.5'), Decimal('0.5'), Decimal('0.5'), Decimal('0.0'), Decimal('0.0'), Decimal('0.3'), Decimal('10.8'))]

Calculate how many YellowTripData records have each type of error discovered during EDA. Use SQL function to understand how many records contain the following errors:
- DropOffDate before PickupDate, DropOffDate before today, PickupDate before today, TripDistance is zero.

In [9]:
%%sql
SELECT
	-- PickupDate is after today
	COUNT (CASE WHEN tpep_pickup_datetime > now() THEN 1 END) AS "FuturePickup",
    -- DropOffDate is after today
	COUNT (CASE WHEN tpep_dropoff_datetime > now() THEN 1 END) AS "FutureDropOff",
    -- PickupDate is after DropOffDate
	COUNT (CASE WHEN tpep_pickup_datetime > tpep_dropoff_datetime THEN 1 END) AS "PickupBeforeDropoff",
    -- TripDistance is 0
	COUNT (CASE WHEN trip_distance = 0 THEN 1 END) AS "ZeroTripDistance"  
FROM yellowtrip;

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(0, 0, 0, 336)]

Create a stored procedure that will apply mean imputation to the YellowTripData records with an incorrect TripDistance of zero.

In [10]:
%%sql
CREATE OR REPLACE PROCEDURE public.cuspimputetripdistancemean()
LANGUAGE 'plpgsql'
AS $BODY$
DECLARE avgtripdistance numeric;
BEGIN
SELECT AVG(trip_distance)
INTO avgtripdistance
FROM public.yellowtrip
WHERE trip_distance > 0;
UPDATE public.yellowtrip
SET trip_distance = avgtripdistance
WHERE trip_distance = 0;
END;
$BODY$;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

Create a function named public.GetTripDistanceHotDeck that returns a TripDistance value via Hot Deck methodology.
Select the first TripDistance value from YellowTripData sample of 1000 records.
The sample of 1000 records should only include those where TripDistance is more than zero.

In [11]:
%%sql
CREATE OR REPLACE FUNCTION public.GetTripDistanceHotDeck()
    RETURNS numeric
    LANGUAGE 'sql'
AS $BODY$
SELECT trip_distance
FROM public.yellowtrip
TABLESAMPLE BERNOULLI (22)
WHERE trip_distance > 0
LIMIT 1
$BODY$;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [12]:
%%sql
select * from GetTripDistanceHotDeck()

 * postgresql://postgres:***@localhost:5432/postgres
1 rows affected.

[(Decimal('13.24'),)]

Create three functions to help solve the business case:
- Convert distance from miles to kilometers.
- Convert currency based on exchange rate parameter.
- Identify the driver shift based on the hour parameter value passed.

Use CREATE FUNCTION to accept @Miles input parameter & return the distance converted to kilometers.

In [14]:
%%sql
CREATE OR REPLACE FUNCTION public.ConvertMileToKm(IN miles numeric)
    RETURNS numeric
    LANGUAGE 'sql'
AS $BODY$
select miles * 1.609
$BODY$;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

Create a function which accepts @DollarAmt and @ExchangeRate input parameters, multiplies them, and returns the result.

In [16]:
%%sql
CREATE OR REPLACE function public.ConvertDollar(IN dollaramt numeric, IN exchangerate numeric)
    RETURNS numeric
    LANGUAGE 'sql'
AS $BODY$
select exchangerate*dollaramt
$BODY$;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

Create a function that returns the shift as an integer: 1st shift is 12am to 9am, 2nd is 9am to 5pm, 3rd is 5pm to 12am.

In [17]:
%%sql
CREATE OR REPLACE FUNCTION public.GetShiftNumber (IN hour integer)
    RETURNS integer
    LANGUAGE 'sql'
AS $BODY$
SELECT(case when hour >= 0 and hour < 9 THEN 1
		 when hour >= 9 and hour < 17 THEN 2
	     when hour >= 17 and hour < 24 THEN 3 END)
$BODY$;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

Now it's time to test the three functions you wrote in the previous exercise.
- Display the first 100 records of PickupDate, TripDistance and FareAmount from YellowTripData.
- Determine the shift value of PickupDate by passing the hour value to public.GetShiftNumber function; display the shift and include it in the WHERE clause for shifts = 2 only.
- Convert TripDistance to kilometers with public.ConvertMiletoKm function.
- Convert FareAmount to Euro (with exchange rate of 0.87) with the public.ConvertDollar function.

In [18]:
%%sql
SELECT
	tpep_pickup_datetime,
	GetShiftNumber(to_char(tpep_pickup_datetime,'HH24')::integer) as Shift,
	fare_amount,
	public.ConvertDollar(fare_amount, 0.87) AS FareinEuro,
	trip_distance,
	public.ConvertMiletoKm(trip_distance) AS TripDistanceinKM
FROM yellowtrip
WHERE public.GetShiftNumber(to_char(tpep_pickup_datetime,'HH24')::integer) = 2
LIMIT 10;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[(datetime.datetime(2019, 6, 28, 13, 9, 8), 2, Decimal('7.5'), Decimal('6.525'), Decimal('1.31'), Decimal('2.10779')),
 (datetime.datetime(2019, 3, 25, 9, 37, 7), 2, Decimal('38.0'), Decimal('33.060'), Decimal('13.24'), Decimal('21.30316')),
 (datetime.datetime(2019, 3, 21, 16, 10, 59), 2, Decimal('8.5'), Decimal('7.395'), Decimal('1.95'), Decimal('3.13755')),
 (datetime.datetime(2019, 2, 23, 16, 48, 38), 2, Decimal('10.0'), Decimal('8.700'), Decimal('2.04'), Decimal('3.28236')),
 (datetime.datetime(2019, 1, 19, 11, 46, 53), 2, Decimal('18.0'), Decimal('15.660'), Decimal('1.73'), Decimal('2.78357')),
 (datetime.datetime(2019, 1, 13, 15, 1, 15), 2, Decimal('6.5'), Decimal('5.655'), Decimal('1.05'), Decimal('1.68945')),
 (datetime.datetime(2019, 1, 1, 14, 44, 59), 2, Decimal('12.5'), Decimal('10.875'), Decimal('3.04'), Decimal('4.89136')),
 (datetime.datetime(2019, 1, 1, 14, 26, 8), 2, Decimal('4.5'), Decimal('3.915'), Decimal('0.72'), Decimal('1.15848')),
 (datetime.datetime(2018, 12, 31, 15, 6, 47), 2, Decimal('5.5'), Decimal('4.785'), Decimal('1.2'), Decimal('1.9308')),
 (datetime.datetime(2018, 12, 31, 12, 24, 57), 2, Decimal('5.5'), Decimal('4.785'), Decimal('0.9'), Decimal('1.4481'))]

Calculate Total Fare Amount per Total Distance for each day of week. If the TripDistance is zero use the Hot Deck imputation function you created earlier.
- Use PickupDate to select the day of week.
- Use AVG() to calculate TotalAmount per TripDistance, and a CASE statement to select TripDistance if it's more than 0. If not, use public.GetTripDistanceHotDeck().
- Order by the PickupDate day of week, with 'Monday' appearing first.

In [19]:
%%sql
SELECT
	CASE WHEN to_char(tpep_pickup_datetime, 'D')::integer = 1 THEN 'Monday'
         WHEN to_char(tpep_pickup_datetime, 'D')::integer = 2 THEN 'Tuesday'
         WHEN to_char(tpep_pickup_datetime, 'D')::integer = 3 THEN 'Wednesday'
         WHEN to_char(tpep_pickup_datetime, 'D')::integer = 4 THEN 'Thursday'
         WHEN to_char(tpep_pickup_datetime, 'D')::integer = 5 THEN 'Friday'
         WHEN to_char(tpep_pickup_datetime, 'D')::integer = 6 THEN 'Saturday'
         WHEN to_char(tpep_pickup_datetime, 'D')::integer = 7 THEN 'Sunday'
END as DayofWeek,
	CAST(AVG(total_amount/
			CASE WHEN trip_distance > 0 THEN trip_distance
     			 ELSE public.GetTripDistanceHotDeck() END) as decimal) as AvgFare
FROM yellowtrip
GROUP BY to_char(tpep_pickup_datetime, 'D');

 * postgresql://postgres:***@localhost:5432/postgres
7 rows affected.

[('Monday', Decimal('10.2556935817805384')),
 ('Tuesday', Decimal('9.07024374301048630295')),
 ('Wednesday', Decimal('7.7200815695700363')),
 ('Thursday', Decimal('6.9251137102014295')),
 ('Friday', Decimal('12.4736160148595626')),
 ('Saturday', Decimal('7.6148819180504954')),
 ('Sunday', Decimal('8.3917101409646261'))]

Write a query to display the TotalDistance, TotalRideTime and TotalFare for each day and NYC Borough. Display the date, distance, ride time, and fare totals for German culture.

In [20]:
%%sql

SELECT
	to_char(tpep_pickup_datetime, 'DD.MM.YYYY') AS PickupDate,
	zone.Borough,
	ROUND(SUM(trip_distance),2) AS TotalDistance,
	SUM((DATE_PART('day', tpep_dropoff_datetime - tpep_pickup_datetime) * 24 + 
               DATE_PART('hour', tpep_dropoff_datetime - tpep_pickup_datetime)) * 60 +
               DATE_PART('minute', tpep_dropoff_datetime - tpep_pickup_datetime)) AS TotalRideTime,
	CAST(SUM(total_amount) as money) AS TotalFare
FROM yellowtrip
INNER JOIN taxizonelookup AS Zone 
ON pulocationid = zone.locationid 
GROUP BY
	to_char(tpep_pickup_datetime, 'DD.MM.YYYY'),
    zone.Borough 
ORDER BY
	to_char(tpep_pickup_datetime, 'DD.MM.YYYY'),
    zone.Borough
limit 10;

 * postgresql://postgres:***@localhost:5432/postgres
10 rows affected.

[('01.01.2019', 'Manhattan', Decimal('18.51'), 548.0, '134,87 €'),
 ('01.01.2019', 'Queens', Decimal('13.95'), 27.0, '56,47 €'),
 ('01.08.2020', 'Manhattan', Decimal('2.30'), 13.0, '11,80 €'),
 ('03.03.2019', 'Manhattan', Decimal('0.92'), 12.0, '11,16 €'),
 ('05.03.2020', 'Manhattan', Decimal('1.39'), 8.0, '12,86 €'),
 ('08.01.2019', 'Manhattan', Decimal('3.53'), 457.0, '28,66 €'),
 ('09.02.2019', 'Manhattan', Decimal('0.75'), 7.0, '8,16 €'),
 ('10.05.2019', 'Manhattan', Decimal('1.45'), 431.0, '12,36 €'),
 ('11.02.2019', 'Manhattan', Decimal('8.32'), 20.0, '30,25 €'),
 ('12.03.2019', 'Manhattan', Decimal('6.37'), 469.0, '38,46 €')]

It's time to write a stored procedure to solve the first objective of the Taxi Ride business case. Calculate AvgFarePerKM, RideCount and TotalRideMin for each NYC borough and weekday. After discussion with stakeholders, you should omit records where the TripDistance is zero.

In [21]:
%%sql
DROP TABLE IF EXISTS spresults;
CREATE TEMP TABLE spresults(
   weekday character varying,
   borough character varying,
   avgfareperkm character varying,
   ridecount character varying,
   totalridemin character varying
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.
Done.

[]

- Select and group by pickup weekday and Borough.
- Calculate AvgFarePerKM with ConvertDollar() and ConvertMiletoKM() utilizing .88 exchange rate to the Euro.
- Display AvgFarePerKM as German currency, RideCount and TotalRideMin.
- Omit records where TripDistance is 0.

In [22]:
%%sql
CREATE OR REPLACE PROCEDURE public.cuspBoroughRideStats(
	)
LANGUAGE 'sql'
AS $BODY$
insert into spresults(SELECT
	TRIM(to_char(tpep_pickup_datetime, 'Day')) as weekday,
	zone.borough AS pickupborough,
	CAST(AVG(public.convertdollar(total_amount, .88)/public.convertmiletokm(trip_distance)) AS money) AS avgfareperkm,
	COUNT(vendorid) AS ridecount,
	SUM((DATE_PART('day', tpep_dropoff_datetime - tpep_pickup_datetime) * 24 + 
               DATE_PART('hour', tpep_dropoff_datetime - tpep_pickup_datetime)) * 60 +
               DATE_PART('minute', tpep_dropoff_datetime - tpep_pickup_datetime)) AS totalridemin
FROM yellowtrip
INNER JOIN taxizonelookup AS Zone 
ON pulocationid = zone.locationid
WHERE trip_distance > 0
GROUP BY TRIM(to_char(tpep_pickup_datetime, 'Day')), zone.Borough
-- visual bug
ORDER BY CASE WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Monday' THEN 1
         	  WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Tuesday' THEN 2
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Wednesday' THEN 3
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Thursday' THEN 4
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Friday' THEN 5
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Saturday' THEN 6
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Sunday' THEN 7 END, 
         SUM((DATE_PART('day', tpep_dropoff_datetime - tpep_pickup_datetime) * 24 + 
               DATE_PART('hour', tpep_dropoff_datetime - tpep_pickup_datetime)) * 60 +
               DATE_PART('minute', tpep_dropoff_datetime - tpep_pickup_datetime)));
$BODY$;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [23]:
%%sql
select * from spresults;

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

Let's see the results of the public.cuspBoroughRideStats:

In [24]:
%%sql
call cuspBoroughRideStats();
select * from spresults;

 * postgresql://postgres:***@localhost:5432/postgres
Done.
17 rows affected.

[('Monday', 'EWR', '20,78 €', '1', '1'),
 ('Monday', 'Staten Island', '1,54 €', '1', '67'),
 ('Monday', 'N/A', '18,98 €', '26', '154'),
 ('Monday', 'Bronx', '2,58 €', '180', '6299'),
 ('Monday', 'Unknown', '6,37 €', '764', '7773'),
 ('Monday', 'Brooklyn', '3,76 €', '647', '12672'),
 ('Monday', 'Queens', '3,73 €', '3008', '93610'),
 ('Monday', 'Manhattan', '5,05 €', '40336', '574094'),
 ('Tuesday', 'Queens', '2,21 €', '1', '27'),
 ('Tuesday', 'Manhattan', '4,37 €', '14', '1477'),
 ('Wednesday', 'Unknown', '2,41 €', '1', '17'),
 ('Wednesday', 'Manhattan', '4,48 €', '2', '22'),
 ('Thursday', 'Unknown', '18,73 €', '1', '3'),
 ('Thursday', 'Manhattan', '3,85 €', '4', '29'),
 ('Friday', 'Manhattan', '4,16 €', '4', '456'),
 ('Saturday', 'Manhattan', '4,59 €', '8', '1356'),
 ('Sunday', 'Manhattan', '5,61 €', '2', '18')]

It's time to solve the second objective of the business case. What are the AvgFarePerKM, RideCount and TotalRideMin for each pickup location and shift within a NYC Borough?

In [25]:
%%sql
DROP TABLE IF EXISTS shiftresults;
CREATE TEMP TABLE shiftresults(
   weekday character varying,
   shift character varying,
   zone character varying,
   avgfareperkm character varying,
   ridecount character varying,
   totalRideMin character varying
);

 * postgresql://postgres:***@localhost:5432/postgres
Done.
Done.

[]

- Create a stored procedure named cuspPickupZoneShiftStats that accepts @Borough nvarchar as an input parameter and limits records with the matching Borough value.
- Calculate the 'Shift' by passing the hour of the PickupDate to the GetShiftNumber() function. Use SQL function to select only the hour portion of the PickupDate.
- Group by PickupDate weekday, shift, and Zone.
- Sort by PickupDate weekday (with Monday first), shift, and TotalRideMin.

In [26]:
%%sql 
CREATE OR REPLACE PROCEDURE public.cuspPickupZoneShiftStats(IN borough character varying)
    LANGUAGE 'sql'
    
AS $BODY$
insert into shiftresults(SELECT TRIM(to_char(tpep_pickup_datetime, 'Day')) as weekda,
getshiftnumber(EXTRACT(HOUR FROM tpep_pickup_datetime)::integer) as shift,
zone.zone,
CAST(AVG(convertdollar(total_amount, .77)/convertmiletokm(trip_distance)) as money) as avgfareperkm,
COUNT(vendorid) AS ridecount,
SUM((DATE_PART('day', tpep_dropoff_datetime - tpep_pickup_datetime) * 24 + 
               DATE_PART('hour', tpep_dropoff_datetime - tpep_pickup_datetime)) * 60 +
               DATE_PART('minute', tpep_dropoff_datetime - tpep_pickup_datetime)) AS TotalRideTime
FROM yellowtrip
INNER JOIN taxizonelookup AS zone 
ON pulocationid = zone.locationid
WHERE
	convertmiletokm(trip_distance) > 0 AND
	zone.borough = borough
GROUP BY 
	TRIM(to_char(tpep_pickup_datetime, 'Day')), 
	getshiftnumber(EXTRACT(HOUR FROM tpep_pickup_datetime)::integer),
	zone.zone
ORDER BY CASE WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Monday' THEN 1
         	  WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Tuesday' THEN 2
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Wednesday' THEN 3
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Thursday' THEN 4
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Friday' THEN 5
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Saturday' THEN 6
              WHEN TRIM(to_char(tpep_pickup_datetime, 'Day')) = 'Sunday' THEN 7 END,
		 getshiftnumber(EXTRACT(HOUR FROM tpep_pickup_datetime)::integer),
         SUM((DATE_PART('day', tpep_dropoff_datetime - tpep_pickup_datetime) * 24 + 
               DATE_PART('hour', tpep_dropoff_datetime - tpep_pickup_datetime)) * 60 +
               DATE_PART('minute', tpep_dropoff_datetime - tpep_pickup_datetime)));
$BODY$;

 * postgresql://postgres:***@localhost:5432/postgres
Done.

[]

In [27]:
%%sql
select * from shiftresults

 * postgresql://postgres:***@localhost:5432/postgres
0 rows affected.

[]

Let's see the AvgFarePerKM,RideCount and TotalRideMin for the pickup locations within Manhattan during the different driver shifts of each weekday.
- Declare @Borough as 'Manhattan'.
- Pass @Borough to execute the dbo.cuspPickupZoneShiftStats stored procedure.

In [28]:
%%sql
call cuspPickupZoneShiftStats('Manhattan');
select * from shiftresults
limit 10;

 * postgresql://postgres:***@localhost:5432/postgres
Done.
10 rows affected.

[('Monday', '1', 'Van Nest/Morris Park', '3,11 €', '1', '0'),
 ('Monday', '1', 'Kew Gardens', '15,79 €', '1', '0'),
 ('Monday', '1', 'South Williamsburg', '9,93 €', '1', '1'),
 ('Monday', '1', 'Inwood', '7,66 €', '1', '3'),
 ('Monday', '1', 'Ocean Hill', '20,21 €', '2', '4'),
 ('Monday', '1', 'Elmhurst/Maspeth', '4,72 €', '1', '5'),
 ('Monday', '1', 'Prospect Park', '2,10 €', '1', '5'),
 ('Monday', '1', 'Columbia Street', '1,79 €', '1', '6'),
 ('Monday', '1', 'Maspeth', '1,45 €', '1', '8'),
 ('Monday', '1', 'Melrose South', '3,01 €', '2', '8')]